#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      + data             = (sensitive value)
      + data_json        = (sensitive value)
      + id               = (known after apply)
      + lease_duration   = (known after apply)
      + lease_id         = (known after apply)
      + lease_renewable  = (known after apply)
      + lease_start_time = (known after apply)
      + path             = "secret/suitable/terraform/stackdriver/slack-token"
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        display_name = "staging"
        enabled      = true
        id           = "projects/terra-datarepo-staging/notificationChannels/18199841202267095917"
      ~ labels       = {
          - "auth_token"   = "xoxb-12729891575-1301495169890-SUYNuZWXKWTdFGkT4W07MfGg"
          - "channel_name" = "#jade-alerts"
        } -> (known after apply)
        name         = "projects/terra-datarepo-staging/notificationChannels/18199841202267095917"
        project      = "terra-datarepo-staging"
        type         = "slack"
        user_labels  = {}
    }

  # module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding will be updated in-place
  ~ resource "google_service_account_iam_binding" "workload-identity-binding" {
        etag               = "BwWxkHegy7U="
        id                 = "projects/terra-datarepo-staging/serviceAccounts/prometheus-sa@terra-datarepo-staging.iam.gserviceaccount.com/roles/iam.workloadIdentityUser"
      ~ members            = [
          - "serviceAccount:terra-datarepo-staging.svc.id.goog[monitoring/datarepo-monitoring-kube-p-prometheus]",
          + "serviceAccount:terra-datarepo-staging.svc.id.goog[monitoring/datarepomonitoring-kube-pr-prometheus]",
        ]
        role               = "roles/iam.workloadIdentityUser"
        service_account_id = "projects/terra-datarepo-staging/serviceAccounts/prometheus-sa@terra-datarepo-staging.iam.gserviceaccount.com"
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `environments/staging`*
